RSVData/src/InformationRegisters/RSVData_КартаАнонимизации/RSVData_КартаАнонимизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>RSVData_КартаАнонимизации</name>
  <resources>
    <name>Токен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СериализованноеЗначение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSVData/src/CommonModules/RSVData_Анонимизация/Module.bsl
#Область ПрограммныйИнтерфейс

// Включена ли анонимизация персональных данных.
// По умолчанию включена (стандарт): значение хранится «от обратного» в константе
// RSVData_АнонимизацияОтключена, чтобы пустая (несконфигурированная) база работала с защитой.
//
// Возвращаемое значение:
//   Булево.
Функция Включена() Экспорт
	Возврат НЕ Константы.RSVData_АнонимизацияОтключена.Получить();
КонецФункции

// Подбирает замену для значения ячейки результата чтения данных.
// Персональные данные заменяются стабильным токеном вида [ОРГ-00001]; одинаковое значение в одной
// категории всегда даёт один и тот же токен (карта — регистр сведений RSVData_КартаАнонимизации).
//
// Параметры:
//   Значение         - Произвольный - исходное значение ячейки (ссылка, строка, число, дата...).
//   ИмяКолонки       - Строка       - имя колонки результата (используется для детекции по реквизиту).
//   ИмяТаблицы       - Строка       - FQN таблицы-источника (для маскирования имени/кода объекта ПДн).
//   Кэш              - Соответствие - кэш токенов в пределах одного ответа (ключ -> токен); может быть Неопределено.
//   ЗаменыПоЗначению - Соответствие - карта замен по самим значениям (КартаЗаменПоЗначениям);
//                                     Неопределено — сверка по значениям не выполняется.
//
// Возвращаемое значение:
//   Строка      - токен-замена, если значение распознано как ПДн;
//   Неопределено - если маскировать не нужно (вызывающий выводит значение как есть).
Функция МаскироватьДляОтвета(Значение, ИмяКолонки, ИмяТаблицы, Кэш, ЗаменыПоЗначению = Неопределено) Экспорт
	Если Значение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если ЗаменыПоЗначению <> Неопределено И ТипЗнч(Значение) = Тип("Строка") Тогда
		ТокенЗамены = ЗаменыПоЗначению.Получить(Значение);
		Если ТокенЗамены <> Неопределено Тогда
			Возврат ТокенЗамены;
		КонецЕсли;
	КонецЕсли;
	Описание = КатегорияЗначения(Значение, ИмяКолонки, ИмяТаблицы);
	Если Описание = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат ПолучитьИлиСоздатьТокен(Описание.Категория, Описание.Представление, Описание.Сериализованное, Кэш);
КонецФункции

// Карта замен для строковых значений страницы ответа: сверка самих значений с данными
// ПДн-справочников конфигурации и с накопленной картой анонимизации. Ловит представления
// ПДн-объектов, попавшие в ответ строкой: ПРЕДСТАВЛЕНИЕ(Ссылка), разыменование наименования
// через точку, произвольные псевдонимы колонок — всё, что детекция по имени колонки не видит.
//
// Параметры:
//   Значения       - Массив из Строка - уникальные строковые значения ячеек страницы ответа.
//   Кэш            - Соответствие - кэш токенов в пределах одного ответа; может быть Неопределено.
//   СсылкиСтраницы - Соответствие - ссылки, встреченные в ячейках этой же страницы (ключ — ссылка);
//                                   при совпадении значения с несколькими объектами-тёзками
//                                   предпочитается объект со страницы. Может быть Неопределено.
//
// Возвращаемое значение:
//   Соответствие - значение -> токен; значения без совпадений в карту не попадают.
Функция КартаЗаменПоЗначениям(Значения, Кэш, СсылкиСтраницы = Неопределено) Экспорт
	Результат = Новый Соответствие;
	Кандидаты = Новый ТаблицаЗначений;
	Кандидаты.Колонки.Добавить("Значение",
		Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(500, ДопустимаяДлина.Переменная)));
	Для Каждого Значение Из Значения Цикл
		Если СтрДлина(Значение) > 500 ИЛИ НЕ ЗначениеЗаполнено(СокрЛП(Значение)) ИЛИ ЭтоТокен(Значение) Тогда
			Продолжить;
		КонецЕсли;
		Кандидаты.Добавить().Значение = Значение;
	КонецЦикла;
	Если Кандидаты.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Пакет = Новый Массив;
	Пакет.Добавить(
		"ВЫБРАТЬ Т.Значение КАК Значение
		|ПОМЕСТИТЬ ВТЗначения
		|ИЗ &Значения КАК Т
		|ИНДЕКСИРОВАТЬ ПО Значение");
	Пакет.Добавить(
		"ВЫБРАТЬ Карта.Токен КАК Токен, ВТ.Значение КАК Значение
		|ИЗ РегистрСведений.RSVData_КартаАнонимизации КАК Карта
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗначения КАК ВТ
		|	ПО ВЫРАЗИТЬ(Карта.Представление КАК СТРОКА(500)) = ВТ.Значение");
	ЧастиСправочников = ЧастиЗапросаПДнСправочников();
	Если ЧастиСправочников.Количество() > 0 Тогда
		Пакет.Добавить(СтрСоединить(ЧастиСправочников, Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС));
	КонецЕсли;

	Запрос = Новый Запрос(СтрСоединить(Пакет, ";" + Символы.ПС));
	Запрос.УстановитьПараметр("Значения", Кандидаты);
	УстановитьПривилегированныйРежим(Истина);
	РезультатыПакета = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);

	ВыборкаКарты = РезультатыПакета[1].Выбрать();
	Пока ВыборкаКарты.Следующий() Цикл
		Результат.Вставить(ВыборкаКарты.Значение, ВыборкаКарты.Токен);
	КонецЦикла;

	// Совпадение со справочником сильнее совпадения с картой: значение получает токен самой
	// ссылки (ключ — GUID), поэтому ссылка и её наименование в ответе дают один токен.
	// Среди объектов-тёзок последним (то есть победителем) вставляется тот, чья ссылка
	// присутствует на этой же странице ответа.
	Если РезультатыПакета.Количество() > 2 Тогда
		Отложенные = Новый Массив;
		ВыборкаСсылок = РезультатыПакета[2].Выбрать();
		Пока ВыборкаСсылок.Следующий() Цикл
			ЕстьНаСтранице = (СсылкиСтраницы <> Неопределено
				И СсылкиСтраницы.Получить(ВыборкаСсылок.Ссылка) <> Неопределено);
			Если ЕстьНаСтранице Тогда
				Отложенные.Добавить(Новый Структура("Категория, Ссылка, Значение",
					ВыборкаСсылок.Категория, ВыборкаСсылок.Ссылка, ВыборкаСсылок.Значение));
			Иначе
				Результат.Вставить(ВыборкаСсылок.Значение, ПолучитьИлиСоздатьТокен(ВыборкаСсылок.Категория,
					Строка(ВыборкаСсылок.Ссылка), ЗначениеВСтрокуВнутр(ВыборкаСсылок.Ссылка), Кэш));
			КонецЕсли;
		КонецЦикла;
		Для Каждого Совпадение Из Отложенные Цикл
			Результат.Вставить(Совпадение.Значение, ПолучитьИлиСоздатьТокен(Совпадение.Категория,
				Строка(Совпадение.Ссылка), ЗначениеВСтрокуВнутр(Совпадение.Ссылка), Кэш));
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Восстанавливает реальное значение из токена — для отборов и параметров запроса, когда агент
// передаёт ранее полученный токен обратно (drill-down). Не-токены возвращаются без изменений.
//
// Параметры:
//   Значение - Произвольный - значение отбора/параметра (строка-токен, массив или иное).
//
// Возвращаемое значение:
//   Произвольный - реальное значение, если на входе был известный токен; иначе исходное значение.
Функция РазмаскироватьЗначение(Значение) Экспорт
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		Результат = Новый Массив;
		Для Каждого Элемент Из Значение Цикл
			Результат.Добавить(РазмаскироватьЗначение(Элемент));
		КонецЦикла;
		Возврат Результат;
	КонецЕсли;
	Если ТипЗнч(Значение) <> Тип("Строка") ИЛИ НЕ ЭтоТокен(Значение) Тогда
		Возврат Значение;
	КонецЕсли;
	Сериализованное = ПолеТокена(СокрЛП(Значение), "СериализованноеЗначение");
	Если НЕ ЗначениеЗаполнено(Сериализованное) Тогда
		Возврат Значение;
	КонецЕсли;
	Попытка
		Возврат ЗначениеИзСтрокиВнутр(Сериализованное);
	Исключение
		Возврат Значение;
	КонецПопытки;
КонецФункции

// Заменяет в тексте все известные токены на реальные представления — финальная расшифровка
// (инструмент reveal): модель работает с токенами, пользователь видит реальные значения.
//
// Параметры:
//   Текст - Строка - текст с токенами вида [ОРГ-00001].
//
// Возвращаемое значение:
//   Строка - текст, где известные токены заменены представлениями (неизвестные оставлены как есть).
Функция РазмаскироватьТекст(Текст) Экспорт
	Результат = "";
	Остаток = Строка(?(Текст = Неопределено, "", Текст));
	Поз = СтрНайти(Остаток, "[");
	Пока Поз > 0 Цикл
		Результат = Результат + Лев(Остаток, Поз - 1);
		Остаток = Сред(Остаток, Поз);
		ПозКонец = СтрНайти(Остаток, "]");
		Если ПозКонец = 0 Тогда
			Результат = Результат + Остаток;
			Остаток = "";
			Прервать;
		КонецЕсли;
		Кандидат = Лев(Остаток, ПозКонец);
		Если ЭтоТокен(Кандидат) Тогда
			Представление = ПолеТокена(Кандидат, "Представление");
			Результат = Результат + ?(ЗначениеЗаполнено(Представление), Представление, Кандидат);
		Иначе
			Результат = Результат + Кандидат;
		КонецЕсли;
		Остаток = Сред(Остаток, ПозКонец + 1);
		Поз = СтрНайти(Остаток, "[");
	КонецЦикла;
	Возврат Результат + Остаток;
КонецФункции

// Гард анонимизации для произвольного запроса: ищет в выбираемых полях выражения,
// ПРЕОБРАЗУЮЩИЕ персональные данные (ПОДСТРОКА/СЦЕПИТЬ/сложение строк над наименованием
// ПДн-объекта и т.п.) — такой результат замене токеном не поддаётся, надёжнее отказать
// до выполнения. Формы, отдающие значение целиком (ПРЕДСТАВЛЕНИЕ, ЕСТЬNULL, МИНИМУМ,
// МАКСИМУМ, ВЫРАЗИТЬ к ссылочному типу), разрешены — их закрывает маскирование по значениям.
//
// Параметры:
//   ТекстЗапроса - Строка - текст запроса.
//
// Возвращаемое значение:
//   Строка       - текст ошибки для отказа;
//   Неопределено - запрос безопасен (или его текст не разобран схемой запроса).
Функция ПроверитьЗапросНаПреобразованиеПДн(ТекстЗапроса) Экспорт
	Схема = Новый СхемаЗапроса;
	Попытка
		Схема.УстановитьТекстЗапроса(ТекстЗапроса);
	Исключение
		Возврат Неопределено; // не разобрали — выполнение и маскирование по значениям остаются
	КонецПопытки;
	КартаВТ = Новый Соответствие;
	Для Каждого ЗапросПакета Из Схема.ПакетЗапросов Цикл
		Если ТипЗнч(ЗапросПакета) <> Тип("ЗапросВыбораСхемыЗапроса") Тогда
			Продолжить;
		КонецЕсли;
		Итог = ПроверитьЗапросВыбора(ЗапросПакета, КартаВТ);
		Если Итог.Ошибка <> Неопределено Тогда
			Возврат Итог.Ошибка;
		КонецЕсли;
		ИмяВременнойТаблицы = "";
		Попытка
			ИмяВременнойТаблицы = ЗапросПакета.ТаблицаДляПомещения;
		Исключение
			ИмяВременнойТаблицы = "";
		КонецПопытки;
		Если ЗначениеЗаполнено(ИмяВременнойТаблицы) Тогда
			КартаВТ.Вставить(НРег(ИмяВременнойТаблицы), Итог.ПДнКолонки);
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

// Пары «имя -> токен» для поиска ВХОЖДЕНИЙ имён ПДн-объектов внутри строковых значений
// (комментарии и другой свободный текст). Источники пар: карта замен по значениям плюс
// представления ПДн-ссылок, встреченных на странице. Отсортированы по убыванию длины имени,
// чтобы длинное имя заменялось раньше короткого, вложенного в него.
//
// Параметры:
//   ЗаменыПоЗначению - Соответствие - карта замен (КартаЗаменПоЗначениям); может быть Неопределено.
//   СсылкиСтраницы   - Соответствие - ссылки из ячеек страницы (ключ — ссылка); может быть Неопределено.
//   Кэш              - Соответствие - кэш токенов в пределах одного ответа; может быть Неопределено.
//
// Возвращаемое значение:
//   Массив из Структура - Имя (Строка), Токен (Строка).
Функция ПарыДляПоискаВхождений(ЗаменыПоЗначению, СсылкиСтраницы, Кэш) Экспорт
	Пары = Новый ТаблицаЗначений;
	Пары.Колонки.Добавить("Имя");
	Пары.Колонки.Добавить("Токен");
	Пары.Колонки.Добавить("Длина");
	Добавленные = Новый Соответствие;
	Если ЗаменыПоЗначению <> Неопределено Тогда
		Для Каждого КлючИЗначение Из ЗаменыПоЗначению Цикл
			ДобавитьПаруВхождения(Пары, Добавленные, КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	Если СсылкиСтраницы <> Неопределено Тогда
		Для Каждого КлючИЗначение Из СсылкиСтраницы Цикл
			Описание = КатегорияЗначения(КлючИЗначение.Ключ, "", "");
			Если Описание = Неопределено Тогда
				Продолжить; // ссылка не на ПДн-объект
			КонецЕсли;
			Токен = ПолучитьИлиСоздатьТокен(Описание.Категория, Описание.Представление, Описание.Сериализованное, Кэш);
			ДобавитьПаруВхождения(Пары, Добавленные, Описание.Представление, Токен);
		КонецЦикла;
	КонецЕсли;
	Пары.Сортировать("Длина Убыв");
	Результат = Новый Массив;
	Для Каждого СтрокаПары Из Пары Цикл
		Результат.Добавить(Новый Структура("Имя, Токен", СтрокаПары.Имя, СтрокаПары.Токен));
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Заменяет в строке вхождения имён ПДн-объектов токенами — страховка для свободного текста,
// который не совпадает с именем целиком (exact-замену выполняет МаскироватьДляОтвета).
//
// Параметры:
//   Строковое - Строка - значение ячейки, не замаскированное целиком.
//   Пары      - Массив из Структура - пары Имя/Токен (ПарыДляПоискаВхождений).
//
// Возвращаемое значение:
//   Строка       - значение с заменёнными вхождениями;
//   Неопределено - вхождений нет (вызывающий выводит значение как есть).
Функция ЗаменитьВхожденияИмен(Строковое, Пары) Экспорт
	Если Пары.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Результат = Строковое;
	БылоИзменение = Ложь;
	Для Каждого Пара Из Пары Цикл
		Если СтрДлина(Результат) >= СтрДлина(Пара.Имя) И СтрНайти(Результат, Пара.Имя) > 0 Тогда
			Результат = СтрЗаменить(Результат, Пара.Имя, Пара.Токен);
			БылоИзменение = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ?(БылоИзменение, Результат, Неопределено);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Определяет категорию ПДн для значения и собирает данные для токена.
// Возвращает Структуру (Категория, Представление, Сериализованное) либо Неопределено.
// Ключ идентичности — сериализованное значение: для ссылки это её GUID (разные объекты с одинаковым
// именем не сливаются), для строки — само содержимое.
Функция КатегорияЗначения(Значение, ИмяКолонки, ИмяТаблицы)
	Если ЭтоСсылка(Значение) Тогда
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Возврат Неопределено;
		КонецЕсли;
		Категория = КатегорияПоИмениОбъекта(Значение.Метаданные().Имя);
		Если Категория = "" Тогда
			Возврат Неопределено;
		КонецЕсли;
		Возврат ОписаниеПДн(Категория, Строка(Значение), ЗначениеВСтрокуВнутр(Значение));
	КонецЕсли;

	ЭтоСтрока = (ТипЗнч(Значение) = Тип("Строка"));
	Строковое = ?(ЭтоСтрока, Значение, Строка(Значение));
	Если НЕ ЗначениеЗаполнено(СокрЛП(Строковое)) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Категория = КатегорияПоИмениКолонки(ИмяКолонки);
	Если Категория = "" И ЭтоКолонкаИмени(ИмяКолонки) Тогда
		Категория = КатегорияТаблицы(ИмяТаблицы);
	КонецЕсли;
	Если Категория = "" И ЭтоСтрока Тогда
		Категория = КатегорияПоЗначениюСтроки(СокрЛП(Строковое));
	КонецЕсли;
	Если Категория = "" Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат ОписаниеПДн(Категория, СокрЛП(Строковое), ЗначениеВСтрокуВнутр(СокрЛП(Строковое)));
КонецФункции

Функция ОписаниеПДн(Категория, Представление, Сериализованное)
	Возврат Новый Структура("Категория, Представление, Сериализованное", Категория, Представление, Сериализованное);
КонецФункции

// Возвращает существующий или создаёт новый стабильный токен для значения категории.
// Ключ записи — хэш сериализованного значения (идентичность), поэтому разные объекты с одинаковым
// представлением получают разные токены, а одно и то же значение — всегда один токен.
//
// Возвращаемое значение:
//   Строка - токен вида [КАТЕГОРИЯ-00001].
Функция ПолучитьИлиСоздатьТокен(Категория, Представление, Сериализованное, Кэш)
	Ключ = КлючСериализации(Сериализованное);
	КэшКлюч = Категория + "|" + Ключ;
	Если Кэш <> Неопределено Тогда
		ИзКэша = Кэш.Получить(КэшКлюч);
		Если ИзКэша <> Неопределено Тогда
			Возврат ИзКэша;
		КонецЕсли;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ Токен КАК Токен
		|ИЗ РегистрСведений.RSVData_КартаАнонимизации
		|ГДЕ Категория = &Категория И КлючЗначения = &Ключ";
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("Ключ", Ключ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Токен = Выборка.Токен;
	Иначе
		Токен = СформироватьТокен(Категория);
		ЗаписатьЗапись(Категория, Ключ, Токен, Сериализованное, Представление);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);

	Если Кэш <> Неопределено Тогда
		Кэш.Вставить(КэшКлюч, Токен);
	КонецЕсли;
	Возврат Токен;
КонецФункции

Процедура ЗаписатьЗапись(Категория, Ключ, Токен, Сериализованное, Представление)
	НаборЗаписей = РегистрыСведений.RSVData_КартаАнонимизации.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Категория.Установить(Категория);
	НаборЗаписей.Отбор.КлючЗначения.Установить(Ключ);
	Запись = НаборЗаписей.Добавить();
	Запись.Категория = Категория;
	Запись.КлючЗначения = Ключ;
	Запись.Токен = Токен;
	Запись.СериализованноеЗначение = Сериализованное;
	Запись.Представление = Представление;
	НаборЗаписей.Записать(Истина);
КонецПроцедуры

// Следующий порядковый номер токена в категории, формат [КАТЕГОРИЯ-00001].
Функция СформироватьТокен(Категория)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК Кол
		|ИЗ РегистрСведений.RSVData_КартаАнонимизации
		|ГДЕ Категория = &Категория";
	Запрос.УстановитьПараметр("Категория", Категория);
	Выборка = Запрос.Выполнить().Выбрать();
	Номер = ?(Выборка.Следующий(), Выборка.Кол, 0) + 1;
	Цифры = Строка(Номер);
	Пока СтрДлина(Цифры) < 5 Цикл
		Цифры = "0" + Цифры;
	КонецЦикла;
	Возврат "[" + Категория + "-" + Цифры + "]";
КонецФункции

// Возвращает поле записи карты по токену (Представление либо СериализованноеЗначение), "" если нет.
//
// Возвращаемое значение:
//   Строка - значение запрошенного поля или пустая строка.
Функция ПолеТокена(Токен, ИмяПоля)
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ Представление КАК Представление, СериализованноеЗначение КАК Сер
		|ИЗ РегистрСведений.RSVData_КартаАнонимизации
		|ГДЕ Токен = &Токен";
	Запрос.УстановитьПараметр("Токен", СокрЛП(Токен));
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = "";
	Если Выборка.Следующий() Тогда
		Результат = ?(ИмяПоля = "Представление", Выборка.Представление, Выборка.Сер);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;
КонецФункции

// Ключ идентичности значения — хэш его сериализации (для ссылки внутри лежит GUID объекта).
Функция КлючСериализации(Сериализованное)
	Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеш.Добавить(Строка(Сериализованное), КодировкаТекста.UTF8);
	Возврат СтрЗаменить(ПолучитьHexСтрокуИзДвоичныхДанных(Хеш.ХешСумма), " ", "");
КонецФункции

// Истина, если строка имеет вид токена [БУКВЫ-ЦИФРЫ].
Функция ЭтоТокен(Значение)
	Стр = СокрЛП(Значение);
	Если СтрДлина(Стр) < 5 ИЛИ Лев(Стр, 1) <> "[" ИЛИ Прав(Стр, 1) <> "]" Тогда
		Возврат Ложь;
	КонецЕсли;
	Тело = Сред(Стр, 2, СтрДлина(Стр) - 2);
	ПозДефис = СтрНайти(Тело, "-");
	Если ПозДефис < 2 Тогда
		Возврат Ложь;
	КонецЕсли;
	Префикс = Лев(Тело, ПозДефис - 1);
	Номер = Сред(Тело, ПозДефис + 1);
	Возврат ТолькоБуквы(Префикс) И ТолькоЦифры(Номер);
КонецФункции

Функция ЭтоСсылка(Значение)
	Если ТипЗнч(Значение) = Тип("Строка") ИЛИ ТипЗнч(Значение) = Тип("Число")
		ИЛИ ТипЗнч(Значение) = Тип("Булево") ИЛИ ТипЗнч(Значение) = Тип("Дата") Тогда
		Возврат Ложь;
	КонецЕсли;
	Попытка
		Возврат Значение.Метаданные() <> Неопределено;
	Исключение
		Возврат Ложь;
	КонецПопытки;
КонецФункции

// Категория ПДн по имени справочника-владельца ссылки ("" — не ПДн).
Функция КатегорияПоИмениОбъекта(ИмяОбъекта)
	Значение = СловарьКатегорийССылок().Получить(НРег(СокрЛП(Строка(ИмяОбъекта))));
	Возврат ?(Значение = Неопределено, "", Значение);
КонецФункции

Функция СловарьКатегорийССылок()
	Словарь = Новый Соответствие;
	Для Каждого Имя Из СтрРазделить("физическиелица,физлица,сотрудники,пользователи,внешниепользователи,кандидаты,контактныелица", ",") Цикл
		Словарь.Вставить(Имя, "ФЛ");
	КонецЦикла;
	Для Каждого Имя Из СтрРазделить("контрагенты,организации,партнеры,партнёры", ",") Цикл
		Словарь.Вставить(Имя, "ОРГ");
	КонецЦикла;
	Возврат Словарь;
КонецФункции

// Категория ПДн таблицы-источника по её FQN (для маскирования имени/кода объекта ПДн), "" — нет.
Функция КатегорияТаблицы(ИмяТаблицы)
	Части = СтрРазделить(Строка(ИмяТаблицы), ".", Ложь);
	Если Части.Количество() <> 2 Тогда
		Возврат "";
	КонецЕсли;
	Возврат КатегорияПоИмениОбъекта(Части[1]);
КонецФункции

// Истина для колонок, несущих представление объекта (имя/код), — у таблицы ПДн они тоже ПДн.
Функция ЭтоКолонкаИмени(ИмяКолонки)
	Имена = "наименование,код,полноенаименование,наименованиеполное,описание,представление";
	Возврат СтрНайти("," + Имена + ",", "," + НРег(СокрЛП(ИмяКолонки)) + ",") > 0;
КонецФункции

// Категория ПДн по имени колонки/реквизита ("" — не распознано).
Функция КатегорияПоИмениКолонки(ИмяКолонки)
	Имя = НРег(СокрЛП(ИмяКолонки));
	Если Имя = "имя" ИЛИ Имя = "фио" ИЛИ СодержитЛюбую(Имя, "фамилия,отчество") Тогда
		Возврат "ФЛ";
	КонецЕсли;
	Если СодержитЛюбую(Имя, "снилс,страховойномер,номерпфр") Тогда
		Возврат "СНИЛС";
	КонецЕсли;
	Если СодержитЛюбую(Имя, "инн") Тогда
		Возврат "ИНН";
	КонецЕсли;
	Если СодержитЛюбую(Имя, "кпп") Тогда
		Возврат "КПП";
	КонецЕсли;
	Если СодержитЛюбую(Имя, "паспорт") Тогда
		Возврат "ПАСПОРТ";
	КонецЕсли;
	Если СодержитЛюбую(Имя, "телефон,phone") Тогда
		Возврат "ТЕЛ";
	КонецЕсли;
	Если СодержитЛюбую(Имя, "email,почта,e-mail") Тогда
		Возврат "ПОЧТА";
	КонецЕсли;
	Если СодержитЛюбую(Имя, "адрес,address") Тогда
		Возврат "АДРЕС";
	КонецЕсли;
	Возврат "";
КонецФункции

// Категория ПДн по самому значению-строке (поле целиком — ИНН/СНИЛС/почта/телефон/адрес), "" — нет.
Функция КатегорияПоЗначениюСтроки(Строковое)
	Если СтрНайти(Строковое, "@") > 1 И СтрНайти(Строковое, ".") > 0 И СтрНайти(Строковое, " ") = 0 Тогда
		Возврат "ПОЧТА";
	КонецЕсли;
	Цифры = ОставитьЦифры(Строковое);
	Если СтрДлина(Цифры) = СтрДлина(СокрЛП(Строковое)) Тогда
		Если СтрДлина(Цифры) = 10 ИЛИ СтрДлина(Цифры) = 12 Тогда
			Возврат "ИНН";
		КонецЕсли;
	КонецЕсли;
	Если ЭтоСНИЛС(Строковое) Тогда
		Возврат "СНИЛС";
	КонецЕсли;
	Если ЭтоТелефон(Строковое) Тогда
		Возврат "ТЕЛ";
	КонецЕсли;
	Если ЭтоАдрес(Строковое) Тогда
		Возврат "АДРЕС";
	КонецЕсли;
	Возврат "";
КонецФункции

// Истина только для строк, похожих на телефон: с "+", со скобками () или 11 цифр на 7/8.
// Намеренно строго — чтобы коды и номера (например "00-00000305") не принимались за телефон.
Функция ЭтоТелефон(Строковое)
	Для НомерСимвола = 1 По СтрДлина(Строковое) Цикл
		Если СтрНайти("0123456789+()- ", Сред(Строковое, НомерСимвола, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Цифры = ОставитьЦифры(Строковое);
	Длина = СтрДлина(Цифры);
	Если СтрНачинаетсяС(СокрЛП(Строковое), "+") И Длина >= 11 И Длина <= 15 Тогда
		Возврат Истина;
	КонецЕсли;
	Если СтрНайти(Строковое, "(") > 0 И СтрНайти(Строковое, ")") > 0 И Длина >= 10 И Длина <= 15 Тогда
		Возврат Истина;
	КонецЕсли;
	Если Длина = 11 И (Лев(Цифры, 1) = "7" ИЛИ Лев(Цифры, 1) = "8") Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

Функция ОставитьЦифры(Строковое)
	Результат = "";
	Для НомерСимвола = 1 По СтрДлина(Строковое) Цикл
		Символ = Сред(Строковое, НомерСимвола, 1);
		Если СтрНайти("0123456789", Символ) > 0 Тогда
			Результат = Результат + Символ;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция СодержитЛюбую(Строковое, СписокЧерезЗапятую)
	Для Каждого Подстрока Из СтрРазделить(СписокЧерезЗапятую, ",", Ложь) Цикл
		Если ЗначениеЗаполнено(Подстрока) И СтрНайти(Строковое, Подстрока) > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

Функция ТолькоБуквы(Строковое)
	Если НЕ ЗначениеЗаполнено(Строковое) Тогда
		Возврат Ложь;
	КонецЕсли;
	Для НомерСимвола = 1 По СтрДлина(Строковое) Цикл
		Символ = НРег(Сред(Строковое, НомерСимвола, 1));
		Если СтрНайти("abcdefghijklmnopqrstuvwxyzабвгдежзийклмнопрстуфхцчшщъыьэюя", Символ) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

Функция ТолькоЦифры(Строковое)
	Если НЕ ЗначениеЗаполнено(Строковое) Тогда
		Возврат Ложь;
	КонецЕсли;
	Для НомерСимвола = 1 По СтрДлина(Строковое) Цикл
		Если СтрНайти("0123456789", Сред(Строковое, НомерСимвола, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

// Части запроса пакетной сверки строковых значений с ПДн-справочниками конфигурации:
// по одной части на каждое поле-представление (Наименование, ПолноеНаименование,
// НаименованиеПолное) каждого справочника из словаря ПДн. Соединение — с временной
// таблицей ВТЗначения, которую создаёт КартаЗаменПоЗначениям.
Функция ЧастиЗапросаПДнСправочников()
	Части = Новый Массив;
	Словарь = СловарьКатегорийССылок();
	Для Каждого ОписаниеСправочника Из Метаданные.Справочники Цикл
		Категория = Словарь.Получить(НРег(ОписаниеСправочника.Имя));
		Если Категория = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Выражения = Новый Массив;
		Если ОписаниеСправочника.ДлинаНаименования > 0 Тогда
			Выражения.Добавить("Спр.Наименование");
		КонецЕсли;
		Для Каждого ИмяПоля Из СтрРазделить("ПолноеНаименование,НаименованиеПолное", ",") Цикл
			Реквизит = ОписаниеСправочника.Реквизиты.Найти(ИмяПоля);
			Если Реквизит = Неопределено ИЛИ НЕ Реквизит.Тип.СодержитТип(Тип("Строка")) Тогда
				Продолжить;
			КонецЕсли;
			Если Реквизит.Тип.КвалификаторыСтроки.Длина = 0 Тогда
				Выражения.Добавить(СтрШаблон("ВЫРАЗИТЬ(Спр.%1 КАК СТРОКА(500))", ИмяПоля));
			Иначе
				Выражения.Добавить("Спр." + ИмяПоля);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Выражение Из Выражения Цикл
			Части.Добавить(СтрШаблон(
				"ВЫБРАТЬ Спр.Ссылка КАК Ссылка, ""%1"" КАК Категория, ВТ.Значение КАК Значение
				|ИЗ Справочник.%2 КАК Спр
				|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗначения КАК ВТ
				|	ПО %3 = ВТ.Значение", Категория, ОписаниеСправочника.Имя, Выражение));
		КонецЦикла;
	КонецЦикла;
	Возврат Части;
КонецФункции

// ---- Гард преобразований ПДн в выбираемых полях запроса (execute_query) ----

// Проверяет запрос выбора: операторы (включая объединения), источники, вложенные запросы.
// Возвращает Структуру: Ошибка (Строка/Неопределено), ПДнКолонки (Соответствие нрег-имён колонок,
// несущих ПДн, — для пометки колонок временных таблиц и вложенных запросов).
Функция ПроверитьЗапросВыбора(ЗапросВыбора, КартаВТ)
	Итог = Новый Структура("Ошибка, ПДнКолонки", Неопределено, Новый Соответствие);
	Для Каждого Оператор Из ЗапросВыбора.Операторы Цикл
		Источники = Новый Соответствие;
		Для Каждого ОписаниеИсточника Из Оператор.Источники Цикл
			Итог.Ошибка = ЗарегистрироватьИсточникЗапроса(ОписаниеИсточника.Источник, Источники, КартаВТ);
			Если Итог.Ошибка <> Неопределено Тогда
				Возврат Итог;
			КонецЕсли;
		КонецЦикла;
		НомерВыражения = -1;
		Для Каждого Выражение Из Оператор.ВыбираемыеПоля Цикл
			НомерВыражения = НомерВыражения + 1;
			Разбор = РазобратьВыражениеВыбора(Строка(Выражение), Источники);
			Если Разбор.Ошибка <> Неопределено Тогда
				Итог.Ошибка = Разбор.Ошибка;
				Возврат Итог;
			КонецЕсли;
			Если Разбор.ЭтоПДн Тогда
				Итог.ПДнКолонки.Вставить(НРег(ИмяКолонкиЗапросаВыбора(ЗапросВыбора, НомерВыражения)), Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат Итог;
КонецФункции

Функция ИмяКолонкиЗапросаВыбора(ЗапросВыбора, НомерКолонки)
	Попытка
		Если НомерКолонки < ЗапросВыбора.Колонки.Количество() Тогда
			Возврат ЗапросВыбора.Колонки[НомерКолонки].Псевдоним;
		КонецЕсли;
	Исключение
		// структура колонок недоступна — колонка останется без пометки ПДн
	КонецПопытки;
	Возврат "";
КонецФункции

Функция ЗарегистрироватьИсточникЗапроса(Источник, Источники, КартаВТ)
	Если ТипЗнч(Источник) = Тип("ВложенныйЗапросСхемыЗапроса") Тогда
		Итог = ПроверитьЗапросВыбора(Источник.Запрос, КартаВТ);
		Если Итог.Ошибка <> Неопределено Тогда
			Возврат Итог.Ошибка;
		КонецЕсли;
		Источники.Вставить(НРег(Источник.Псевдоним),
			Новый Структура("Вид, Имя, ПДнКолонки", "вложенный", "", Итог.ПДнКолонки));
		Возврат Неопределено;
	КонецЕсли;
	ИмяТаблицы = "";
	Псевдоним = "";
	Попытка
		ИмяТаблицы = Строка(Источник.ИмяТаблицы);
		Псевдоним = Строка(Источник.Псевдоним);
	Исключение
		Возврат Неопределено; // неизвестный вид источника — гард его пропускает
	КонецПопытки;
	ПДнКолонкиВТ = КартаВТ.Получить(НРег(ИмяТаблицы));
	Описание = Новый Структура("Вид, Имя, ПДнКолонки",
		?(ПДнКолонкиВТ = Неопределено, "таблица", "вт"), ИмяТаблицы, ПДнКолонкиВТ);
	Если ЗначениеЗаполнено(Псевдоним) Тогда
		Источники.Вставить(НРег(Псевдоним), Описание);
	Иначе
		Части = СтрРазделить(ИмяТаблицы, ".", Ложь);
		Источники.Вставить(НРег(Части[Части.Количество() - 1]), Описание);
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция РазобратьВыражениеВыбора(ТекстВыражения, Источники)
	Разбор = Новый Структура("Ошибка, ЭтоПДн", Неопределено, Ложь);
	Текст = СокрЛП(ТекстВыражения);
	Если ЭтоПростаяЦепочкаПолей(Текст) Тогда
		Разбор.ЭтоПДн = ЦепочкаЧитаетПДн(Текст, Источники);
		Возврат Разбор;
	КонецЕсли;
	ПДнЦепочка = "";
	Для Каждого Цепочка Из ЦепочкиПолейВыражения(Текст) Цикл
		Если ЦепочкаЧитаетПДн(Цепочка, Источники) Тогда
			ПДнЦепочка = Цепочка;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ПДнЦепочка = "" Тогда
		Возврат Разбор;
	КонецЕсли;
	Разбор.ЭтоПДн = Истина;
	Если НЕ ЭтоФормаБезПреобразованияЗначения(Текст) Тогда
		Разбор.Ошибка = СтрШаблон(
			"Анонимизация: выражение ""%1"" преобразует персональные данные (%2) — замена токеном невозможна.
			|Выберите поле целиком (например, Ссылка, Наименование или ПРЕДСТАВЛЕНИЕ(Ссылка)) — в ответе оно
			|будет заменено токеном; отбор по токену в параметрах запроса работает (drill-down).",
			ТекстВыражения, ПДнЦепочка);
	КонецЕсли;
	Возврат Разбор;
КонецФункции

// Истина, если цепочка "Псевдоним.Поле[.Поле...]" читает представление/реквизит ПДн-объекта.
Функция ЦепочкаЧитаетПДн(Цепочка, Источники)
	Сегменты = СтрРазделить(Цепочка, ".", Ложь);
	Если Сегменты.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	Описание = Источники.Получить(НРег(Сегменты[0]));
	НачалоПолей = 1;
	Если Описание = Неопределено Тогда
		Если Источники.Количество() = 1 Тогда
			Для Каждого КлючИЗначение Из Источники Цикл
				Описание = КлючИЗначение.Значение;
			КонецЦикла;
			НачалоПолей = 0;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	Если Сегменты.Количество() <= НачалоПолей Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Описание.Вид <> "таблица" Тогда
		Возврат Описание.ПДнКолонки <> Неопределено
			И Описание.ПДнКолонки.Получить(НРег(Сегменты[НачалоПолей])) <> Неопределено;
	КонецЕсли;
	ТекущаяТаблица = Описание.Имя;
	Для Индекс = НачалоПолей По Сегменты.Количество() - 2 Цикл
		ТекущаяТаблица = ТаблицаСсылочногоПоля(ТекущаяТаблица, Сегменты[Индекс]);
		Если ТекущаяТаблица = "" Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	ПоследнийСегмент = Сегменты[Сегменты.Количество() - 1];
	Если ЭтоКолонкаИмени(ПоследнийСегмент) И КатегорияТаблицы(ТекущаяТаблица) <> "" Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат КатегорияПоИмениКолонки(ПоследнийСегмент) <> "";
КонецФункции

// Полное имя таблицы, на которую ссылается поле объекта (для разыменования цепочки), "" — не ссылка.
Функция ТаблицаСсылочногоПоля(ПолноеИмяТаблицы, ИмяПоля)
	Объект = Метаданные.НайтиПоПолномуИмени(ПолноеИмяТаблицы);
	Если Объект = Неопределено Тогда
		Части = СтрРазделить(Строка(ПолноеИмяТаблицы), ".", Ложь);
		Если Части.Количество() > 2 Тогда // виртуальная таблица регистра
			Объект = Метаданные.НайтиПоПолномуИмени(Части[0] + "." + Части[1]);
		КонецЕсли;
	КонецЕсли;
	Если Объект = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Поле = ПолеОбъектаМетаданных(Объект, ИмяПоля);
	Если Поле = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Для Каждого ТипПоля Из Поле.Тип.Типы() Цикл
		ОбъектТипа = Метаданные.НайтиПоТипу(ТипПоля);
		Если ОбъектТипа <> Неопределено Тогда
			Возврат ОбъектТипа.ПолноеИмя();
		КонецЕсли;
	КонецЦикла;
	Возврат "";
КонецФункции

Функция ПолеОбъектаМетаданных(Объект, ИмяПоля)
	Для Каждого ИмяКоллекции Из СтрРазделить("Реквизиты,Измерения,Ресурсы,СтандартныеРеквизиты", ",") Цикл
		Коллекция = Неопределено;
		Попытка
			Коллекция = Объект[ИмяКоллекции];
		Исключение
			Продолжить;
		КонецПопытки;
		Для Каждого Поле Из Коллекция Цикл
			Если НРег(Поле.Имя) = НРег(ИмяПоля) Тогда
				Возврат Поле;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

// Извлекает из текста выражения цепочки полей "Псевдоним.Поле..." и одиночные идентификаторы-поля.
// Строковые литералы, параметры (&Имя) и имена функций (идентификатор перед скобкой) пропускаются.
Функция ЦепочкиПолейВыражения(ТекстВыражения)
	Цепочки = Новый Массив;
	Длина = СтрДлина(ТекстВыражения);
	Позиция = 1;
	Пока Позиция <= Длина Цикл
		Символ = Сред(ТекстВыражения, Позиция, 1);
		Если Символ = """" Тогда
			Позиция = ПозицияЗаЛитералом(ТекстВыражения, Позиция);
			Продолжить;
		КонецЕсли;
		Если Символ = "&" Тогда
			Позиция = Позиция + 1;
			Пока Позиция <= Длина И ЭтоСимволИдентификатора(Сред(ТекстВыражения, Позиция, 1)) Цикл
				Позиция = Позиция + 1;
			КонецЦикла;
			Продолжить;
		КонецЕсли;
		Если ЭтоСимволИдентификатора(Символ) И НЕ ТолькоЦифры(Символ) Тогда
			Начало = Позиция;
			Пока Позиция <= Длина Цикл
				Символ = Сред(ТекстВыражения, Позиция, 1);
				Если ЭтоСимволИдентификатора(Символ) ИЛИ Символ = "." Тогда
					Позиция = Позиция + 1;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Цепочка = Сред(ТекстВыражения, Начало, Позиция - Начало);
			ПозицияПосле = Позиция;
			Пока ПозицияПосле <= Длина И Сред(ТекстВыражения, ПозицияПосле, 1) = " " Цикл
				ПозицияПосле = ПозицияПосле + 1;
			КонецЦикла;
			ЭтоВызовФункции = (СтрНайти(Цепочка, ".") = 0
				И ПозицияПосле <= Длина И Сред(ТекстВыражения, ПозицияПосле, 1) = "(");
			Если НЕ ЭтоВызовФункции Тогда
				Цепочки.Добавить(Цепочка);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		Позиция = Позиция + 1;
	КонецЦикла;
	Возврат Цепочки;
КонецФункции

Функция ПозицияЗаЛитералом(Текст, ПозицияКавычки)
	Позиция = ПозицияКавычки + 1;
	Длина = СтрДлина(Текст);
	Пока Позиция <= Длина Цикл
		Если Сред(Текст, Позиция, 1) = """" Тогда
			Если Сред(Текст, Позиция + 1, 1) = """" Тогда
				Позиция = Позиция + 2;
				Продолжить;
			КонецЕсли;
			Возврат Позиция + 1;
		КонецЕсли;
		Позиция = Позиция + 1;
	КонецЦикла;
	Возврат Позиция;
КонецФункции

Функция ЭтоСимволИдентификатора(Символ)
	Возврат Символ = "_" ИЛИ ТолькоБуквы(Символ) ИЛИ ТолькоЦифры(Символ);
КонецФункции

Функция ЭтоПростаяЦепочкаПолей(Текст)
	Если Текст = "" ИЛИ ТолькоЦифры(Лев(Текст, 1)) Тогда
		Возврат Ложь;
	КонецЕсли;
	Для Позиция = 1 По СтрДлина(Текст) Цикл
		Символ = Сред(Текст, Позиция, 1);
		Если НЕ (ЭтоСимволИдентификатора(Символ) ИЛИ Символ = ".") Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

// Истина для форм, отдающих значение ЦЕЛИКОМ (их закрывает маскирование по значениям):
// ПРЕДСТАВЛЕНИЕ/ЕСТЬNULL/МИНИМУМ/МАКСИМУМ над простыми аргументами, ВЫРАЗИТЬ к ссылочному типу.
Функция ЭтоФормаБезПреобразованияЗначения(ТекстВыражения)
	Текст = НРег(СокрЛП(ТекстВыражения));
	Если НЕ СтрЗаканчиваетсяНа(Текст, ")") Тогда
		Возврат Ложь;
	КонецЕсли;
	СписокФункций = "представление,представлениессылки,естьnull,минимум,максимум,presentation,refpresentation,isnull,min,max";
	Для Каждого ИмяФункции Из СтрРазделить(СписокФункций, ",") Цикл
		Если СтрНачинаетсяС(Текст, ИмяФункции + "(") Тогда
			Внутри = Сред(Текст, СтрДлина(ИмяФункции) + 2, СтрДлина(Текст) - СтрДлина(ИмяФункции) - 2);
			Возврат СтрНайти(Внутри, "(") = 0;
		КонецЕсли;
	КонецЦикла;
	Для Каждого ИмяФункции Из СтрРазделить("выразить,cast", ",") Цикл
		Если НЕ СтрНачинаетсяС(Текст, ИмяФункции + "(") Тогда
			Продолжить;
		КонецЕсли;
		Внутри = Сред(Текст, СтрДлина(ИмяФункции) + 2, СтрДлина(Текст) - СтрДлина(ИмяФункции) - 2);
		Если СтрНайти(Внутри, "(") > 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		РазделительКак = ?(СтрНайти(Внутри, " как ") > 0, " как ", " as ");
		ПозицияКак = СтрНайти(Внутри, РазделительКак);
		Если ПозицияКак = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		ТипНазначения = СокрЛП(Сред(Внутри, ПозицияКак + СтрДлина(РазделительКак)));
		СсылочныеПрефиксы = "справочник.,документ.,перечисление.,планвидовхарактеристик.,плансчетов.,планвидоврасчета.,бизнеспроцесс.,задача.,планобмена.,catalog.,document.,enum.";
		Для Каждого Префикс Из СтрРазделить(СсылочныеПрефиксы, ",") Цикл
			Если СтрНачинаетсяС(ТипНазначения, Префикс) Тогда
				Возврат Истина; // значение остаётся ссылкой и маскируется как ссылка
			КонецЕсли;
		КонецЦикла;
		Возврат Ложь;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

// ---- Вхождения имён ПДн-объектов в свободном тексте ----

Процедура ДобавитьПаруВхождения(Пары, Добавленные, Имя, Токен)
	ИмяСтрокой = СокрЛП(Имя);
	// имена короче 5 символов дают ложные вхождения; равенство целиком ловит exact-замена
	Если СтрДлина(ИмяСтрокой) < 5 ИЛИ Добавленные.Получить(ИмяСтрокой) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	Добавленные.Вставить(ИмяСтрокой, Истина);
	СтрокаПары = Пары.Добавить();
	СтрокаПары.Имя = ИмяСтрокой;
	СтрокаПары.Токен = Токен;
	СтрокаПары.Длина = СтрДлина(ИмяСтрокой);
КонецПроцедуры

#КонецОбласти


#Область РаспознаваниеПоФорматуЗначения

// СНИЛС: 11 цифр в формате ###-###-### ## (с дефисами), не похож на телефон (не 7/8, без +/скобок).
Функция ЭтоСНИЛС(Строковое)
	Цифры = ОставитьЦифры(Строковое);
	Если СтрДлина(Цифры) <> 11 Тогда
		Возврат Ложь;
	КонецЕсли;
	Если СтрНайти(Строковое, "-") = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	Если СтрНайти(Строковое, "+") > 0 ИЛИ СтрНайти(Строковое, "(") > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	Перв = Лев(Цифры, 1);
	Возврат Перв <> "7" И Перв <> "8";
КонецФункции

// Адрес: почтовый индекс (6 цифр подряд) + хотя бы один адресный маркер, либо 3+ маркера.
// Консервативно — чтобы обычный текст не принимался за адрес.
Функция ЭтоАдрес(Строковое)
	Если СтрДлина(Строковое) < 15 Тогда
		Возврат Ложь;
	КонецЕсли;
	Текст = НРег(Строковое);
	Маркеры = "ул,город, г.,область,обл,респ,край,район,р-н,проспект,пр-кт,переулок,пер,шоссе,дом,квартир,кв.,микрорайон,мкр,деревня,село,пос.,индекс";
	Счётчик = 0;
	Для Каждого Маркер Из СтрРазделить(Маркеры, ",", Ложь) Цикл
		Если ЗначениеЗаполнено(Маркер) И СтрНайти(Текст, Маркер) > 0 Тогда
			Счётчик = Счётчик + 1;
		КонецЕсли;
	КонецЦикла;
	Возврат (ЕстьШестизначныйИндекс(Строковое) И Счётчик >= 1) ИЛИ Счётчик >= 3;
КонецФункции

Функция ЕстьШестизначныйИндекс(Строковое)
	Подряд = 0;
	Для НомерСимвола = 1 По СтрДлина(Строковое) Цикл
		Если СтрНайти("0123456789", Сред(Строковое, НомерСимвола, 1)) > 0 Тогда
			Подряд = Подряд + 1;
			Если Подряд >= 6 Тогда
				Возврат Истина;
			КонецЕсли;
		Иначе
			Подряд = 0;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

#КонецОбласти
